Show / Hide Table of Contents
Class OpenAttribute
Open attribute base class
Inheritance
System.Object
OpenObject
OpenAttribute
ConcreteMemberData
CrossSectionCreepCoefficientAttribute
CrossSectionThermalAttribute
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel
Assembly: IdeaRS.OpenModel.dll
Syntax
public abstract class OpenAttribute : OpenObject
Properties
Improve this Doc   View Source
Element
Element for attribute
Declaration
public ReferenceElement Element { get; set; }
Property Value
 Type |  Description
 ReferenceElement
 Improve this Doc
 View Source